IDEA StatiCa Open Model
TendonBar.TendonType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Tendon type
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public TendonBarType TendonType { get; set; }
Public Property TendonType As TendonBarType
	Get
	Set
public:
property TendonBarType TendonType {
	TendonBarType get ();
	void set (TendonBarType value);
}
Property Value
Type: TendonBarType
See Also
Reference
TendonBar Class
IdeaRS.OpenModel.CrossSection Namespace